#+TITLE: Game Programming with Python
#+AUTHOR: Marcus Birkenkrahe, Lyon College
#+OPTIONS: toc:nil num:nil
#+STARTUP: indent hideblocks overview
*Lyon College Discovery Day 2025 STEM workshop*

- Link: https://tinyurl.com/LyonPython2025
- Includes: Script + Sample code + Game extension

* Python Basics (Live Demo)

In the workshop, I'll show these commands live for you to code
along. In the script, I provide more technical background - this is
what you'd learn if you took an introductory programming class.

- *Variables*: These are boxes to store stuff, like a number or a name.

  #+begin_src python
    box = 7                       # a numeric variable
    secret_number = 9             # another numeric variable
    box, secret_number            # priting two variables as a tuple
    name = "Marcus"               # defining a string variable
    print(name)                   # printing a variable (reusable)
    print("Marcus")               # printing a string (immutable)
  #+end_src

  #+RESULTS:
  : Marcus
  : Marcus

- *Input*: This lets players type something. 
    
  #+begin_example python 
    input()
    input("Enter a number: ")          # returns string
    int(input("Enter a number: "))     # returns integer
    guess = int(input("Enter a number: "))  # store in variable `guess`
    print(guess)                       # print `guess`
  #+end_example

- *If-statements*: The computer decides what to do based on your =guess=.
  
  #+begin_src python
    secret_number = 7
    guess = 7

    if guess == secret_number:
        print("You win!")
    else:
        print("Try again!")
  #+end_src

  #+RESULTS:
  : Try again!

- *Loops*: Keep asking until they guess right.

  #+begin_example python
    guess, secret_number  # for example (5,9)

    while guess != secret_number:            # stops when 9 is entered
        guess = int(input("Guess again: "))
  #+end_example

- *Live Demo*: Simple version of the game for demonstration.

  #+begin_example python
  secret_number = 5
  guess = int(input("Guess a number between 1 and 10: "))
  while guess != secret_number:
     if guess < secret_number:
        print("Too low!")
     else:
        print("Too high!")
     guess = int(input("Guess again: "))
  print("You got it!")
  #+end_example

